Repository: coteditor/CotEditor
Catalog: CotEditor/Localizables/Text Finder/TextFind.xcstrings
Source language: en
Languages: cs, de, es, fr, it, ja, ko, nl, pl, pt, ru, tr, zh_hans, zh_hant

source: Replace the current selection with the replacement text, then find the next match.
cs: Nahradit aktuální výběr nahrazovacím textem a poté najít další shodu.
de: Die aktuelle Auswahl durch den Ersetzungstext ersetzen, dann den nächsten Treffer suchen.
es: Reemplace la selección actual con el texto de reemplazo y, a continuación, busque la siguiente coincidencia.
fr: Remplacer la sélection avec le texte de remplacement, puis chercher la prochaine correspondance.
it: Sostituisci la selezione attuale con il testo sostitutivo, poi passa al risultato successivo.
ja: 現在の選択範囲を置換テキストで置き換えてから、次の一致を検索
ko: 현재 선택된 부분을 대치하고, 일치하는 다음 항목을 찾습니다.
nl: Vervang de huidige selectie door de vervangende tekst en zoek dan de volgende overeenkomst.
pl: Zastąp bieżące zaznaczenie tekstem zastępującym, a następnie znajdź kolejne dopasowanie.
pt: Substitua a seleção atual pelo texto de substituição e busque a ocorrência seguinte.
ru: Заменить все выделенным текстом и продолжить поиск
tr: Geçerli seçimi değiştirilecek metinle değiştir, sonrasında bir sonraki eşleşmeyi bul.
zh_hans: 用替换文本替换当前选中内容，然后查找下一个匹配项目
zh_hant: 用取代文字取代當前選中內容，然後查找下一個匹配項目

source: Replace with
cs: Nahradit
de: Ersetzen
es: Reemplazar con
fr: Remplacer
it: Sostituisci
ja: 置換
ko: 대치
nl: Vervang met
pl: Zastąp
pt: Substituir
ru: Заменить значением
tr: Değiştir
zh_hans: 替换
zh_hant: 取代

source: Search wrapped.
cs: Hledání dokončeno.
de: Die Suche startet von vorn.
es: Búsqueda terminada.
fr: Retour au début.
it: Ricerca dall’inizio
ja: 検索が折り返されました。
ko: 검색 순환됨.
nl: Zoek teruggelopen.
pl: Zawinięto wyszukiwanie.
pt: A busca voltou ao início.
ru: Начать поиск с начала
tr: Arama baştan sürüyor
zh_hans: 已从头搜索
zh_hant: 已從頭搜索

source: Searching in text…
cs: Hledání v textu…
de: Im Text suchen …
es: Buscando en el texto…
fr: Recherche en cours…
it: Ricerca nel testo…
ja: テキストを検索しています…
ko: 텍스트 검색 중…
nl: Zoeken in tekst…
pl: Wyszukiwanie w tekście…
pt: Buscando no texto…
ru: Ищем
tr: Metinde aranıyor…
zh_hans: 正在文本中搜索…
zh_hant: 正在文字中搜索⋯

source: Select All
cs: Vybrat vše
de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: すべてを選択
ko: 모두 선택
nl: Selecteer alles
pl: Zaznacz wszystkie
pt: Selecionar Tudo
ru: Выделить все
tr: Tümünü Seç
zh_hans: 全部选择
zh_hant: 全部選擇

source: Select to ignore character case on search.
cs: Chcete-li při hledání ignorovat velikost písmen vyberte tuto volbu.
de: Auswählen, um beim Suchen Groß-/Kleinschreibung zu ignorieren.
es: Seleccione para ignorar las mayúsculas y minúsculas del carácter en la búsqueda.
fr: Sélectionnez pour ignorer la casse lors de la recherche.
it: Selezionare per ignorare maiuscole/minuscole nella ricerca.
ja: 大文字/小文字を区別せずに検索する場合に選択
ko: 대소문자를 무시하고 검색하려면 선택하십시오.
nl: Selecteer om hoofdletters en kleine letters te negeren bij het zoeken.
pl: Wybierz, aby ignorować wielkość liter podczas wyszukiwania.
pt: Selecione para ignorar maiúsculas/minúsculas ao buscar.
ru: Выберите, чтобы игнорировать регистр символа при поиске.
tr: Seçimde BÜYÜK/küçük harf yok saymak için seçin.
zh_hans: 选中以忽略大小写。
zh_hant: 選中以忽略大小寫。

source: Select to search text only from selection.
cs: Chcete-li hledat text pouze ve výběru vyberte tuto volbu.
de: Auswählen, um nur in der Auswahl zu suchen.
es: Seleccione para buscar texto solo de la selección.
fr: Sélectionnez pour rechercher le texte seulement dans la sélection.
it: Selezionare per ricercare testo solo all’interno della selezione.
ja: 現在の選択範囲のみを検索対象とする場合に選択
ko: 선택된 부분에서만 텍스트를 검색하려면 선택하십시오.
nl: Selecteer om alleen tekst uit de selectie te zoeken.
pl: Wybierz, aby wyszukiwać tekst tylko z zaznaczenia.
pt: Selecione para buscar apenas no texto da seleção.
ru: Выберите для поиска текста только из выделения.
tr: Yalnızca seçimden arama yapmak için seçin.
zh_hans: 选中仅在选择范围内进行文本查找。
zh_hant: 選中僅在選擇範圍內進行文字尋找。

source: Select to search with regular expression.
cs: Chcete-li hledat pomocí regulárního výrazu vyberte tuto volbu.
de: Auswählen, um mit regulärem Ausdruck zu suchen.
es: Seleccione para buscar con expresión regular.
fr: Sélectionnez pour rechercher à l’aide d’une expression régulière.
it: Selezionare per ricercare con le espressioni regolari.
ja: 検索に正規表現を使う場合に選択
ko: 정규표현식으로 검색하려면 선택하십시오.
nl: Selecteer om te zoeken met reguliere expressie.
pl: Wybierz, aby szukać z użyciem wyrażenia regularnego.
pt: Selecione para buscar com expressão regular.
ru: Выберите для поиска с регулярным выражением.
tr: Düzenli ifade kullanarak aramak için seçin.
zh_hans: 选中以启用正则表达式查找。
zh_hant: 選中以啟用常規表示式尋找。

source: Show advanced options
cs: Zobrazit pokročilé volby
de: Erweiterte Optionen einblenden
es: Mostrar opciones avanzadas
fr: Afficher les options avancées
it: Mostra opzioni avanzate
ja: 詳細オプションを表示
ko: 고급 옵션 보기
nl: Toon geavanceerde opties
pl: Pokaż opcje zaawansowane
pt: Mostrar opções avançadas
ru: Показать дополнительные настройки
tr: Gelişmiş seçenekleri göster
zh_hans: 显示高级选项
zh_hant: 顯示進階選項

source: Show quick reference for regular expression syntax.
cs: Zobrazit stručný přehled syntaxe regulárního výrazu.
de: Kurzreferenz des regulären Ausdrucks anzeigen.
es: Mostrar referencia rápida para la sintaxis de expresiones regulares.
fr: Affiche un pense-bête pour les expressions régulières
it: Mostra un riferimento rapido per la sintassi delle espressioni regolari.
ja: 正規表現文法の簡易用語集を表示
ko: 정규표현식에 대한 참고 자료를 표시합니다.
nl: Toon snelle referentie voor syntaxis van reguliere uitdrukkingen.
pl: Pokaż skrócony podręcznik składni wyrażeń regularnych.
pt: Mostre a referência rápida da sintaxe de expressões regulares.
ru: Показать краткую ссылку на синтаксис регулярных выражений.
tr: Düzenli ifade sözdizimi için hızlı başvuruyu göster.
zh_hans: 显示正则表达式快速参考。
zh_hant: 顯示常規表示式快速參考。

# TextFind.Error.emptyFindString.errorDescription
source: Empty find text
cs: Prázdný hledaný text
de: Leerer Suchbegriff
fr: Texte de recherche vide
it: Nessun testo trovato
ja: 検索テキストが空です。
ko: 찾을 텍스트가 비어 있습니다.
nl: Leeg zoektekst
pl: Szukany tekst jest pusty
pt: Texto de busca vazio
ru: Не указан текст для поиска
tr: Bulunacak metin boş
zh_hans: 查找内容为空
zh_hant: 尋找內容為空

# TextFind.Error.emptyFindString.recoverySuggestion
source: Input text to find.
cs: Zadejte hledaný text.
de: Gib den zu findenden Text ein.
es: Introduzca texto a encontrar.
fr: Texte à rechercher
it: Inserire il testo da cercare.
ja: 検索するテキストを入力してください。
ko: 찾을 텍스트를 입력하십시오.
nl: Voer tekst in om te zoeken.
pl: Wprowadź tekst do znalezienia.
pt: Digite o texto a buscar.
ru: Введите текст для поиска
tr: Bulunacak girdi metni
zh_hans: 输入文本以查找。
zh_hant: 輸入文字以查找。

# TextFind.Error.emptyInSelectionSearch.errorDescription
source: The option “in selection” is selected, although nothing is selected.
cs: Je vybrána volba „Ve výběru“, ačkoli není nic vybráno.
de: Die Option „In Auswahl“ ist aktiviert, obwohl nichts ausgewählt ist.
es: La opción “in selection” está seleccionada, aunque no se selecciona nada.
fr: L’option « Dans la sélection » est activée mais il n’y a aucune sélection.
it: L’opzione “nella selezione” è attiva, ma non è stato selezionato nulla.
ja: ”選択範囲のみ”オプションが有効になっていますが、何も選択されていません。
ko: ‘선택된 부분에서’ 옵션이 켜져있지만, 선택된 부분이 없습니다.
nl: De optie 'in selectie' is geselecteerd, hoewel er niets is geselecteerd.
pl: Wybrano opcję „w zaznaczeniu”, chociaż nic nie jest zaznaczone.
pt: A opção “Na Seleção” está habilitada, porém nada está selecionado.
ru: Опция поиска «в найденом тексте» выбрана, но ничего не выбрали в документе.
tr: “seçimde” seçeneği etkin; ancak hiçbir şey seçilmemiş.
zh_hans: “在选择中搜索”选项被激活，但是并没有内容被选中。
zh_hant: 「在選擇中搜索」選項被激活，但是並沒有內容被選中。

# TextFind.Error.emptyInSelectionSearch.recoverySuggestion
source: Select the search scope in the document or deselect the “in selection” option.
cs: Vyberte v dokumentu rozsah hledání, nebo zrušte volbu „Ve výběru“.
de: Wähle den Suchbereich im Dokument oder deaktiviere die Option „In Auswahl“.
es: Seleccione el ámbito de búsqueda en el documento o deshabilite la opción “in selection”.
fr: Sélectionnez le périmètre de recherche dans le document ou désactivez l’option « dans la sélection ».
it: Selezionare l’ambito di ricerca nel documento, oppure disabilitare l’opzione “nella selezione”.
ja: 検索範囲を選択するか”選択範囲のみ”オプションを無効にしてください。
ko: 문서에서 찾기 영역을 선택하거나 ‘선택된 부분에서’ 옵션을 끄십시오.
nl: Selecteer het zoekbereik in het document of schakel de optie 'in selectie' uit.
pl: Wybierz zakres wyszukiwania w dokumencie lub wyłącz opcję „w zaznaczeniu”.
pt: Selecione o escopo da busca no documento ou desmarque a opção “Na Seleção”.
ru: Выберите область поиска в документе или выключите опцию поиска «в найденом тексте».
tr: Vyberte rozsah vyhledávání v dokumentu nebo zakažte možnost „ve výběru“.
zh_hans: 在文稿中选择搜索范围，或者禁用“在选择中搜索”。
zh_hant: 在文件中選擇搜索範圍，或者禁用「在選擇中搜索」。

# TextFind.Error.regularExpression.errorDescription
source: Invalid regular expression
cs: Neplatný regulární výraz
de: Ungültiger regulärer Ausdruck
es: Expresión regular no válida
fr: Expression régulière invalide
it: Espressione regolare non valida
ja: 無効な正規表現です。
ko: 유효하지 않은 정규표현식
nl: Ongeldige reguliere expressie
pl: Nieprawidłowe wyrażenie regularne
pt: Expressão regular inválida
ru: Некорректное регулярное выражение
tr: Geçersiz düzenli ifade
zh_hans: 无效的正则表达式
zh_hant: 無效的常規表示式

source: Textual Search
cs: Hledání v textu
de: Textuelle Suche
es: Búsqueda textual
fr: Recherche textuelle
it: Ricerca testuale
ja: テキスト検索
ko: 텍스트 검색
nl: Tekstueel zoeken
pl: Wyszukiwanie tekstowe
pt: Busca Textual
ru: Текстовый поиск
tr: Metin Araması
zh_hans: 文本查找
zh_hant: 文字尋找

source: Type the text to replace the found text.
cs: Zadejte text, který nahradí nalezený text.
de: Ersetzungstext für den gefundenen Suchbegriff eingeben.
es: Escribe el texto para reemplazar el texto encontrado.
fr: Tapez le texte qui doit remplacer les résultats de recherche.
it: Inserire il testo con cui sostituire il testo trovato.
ja: 見つかったテキストと入れ替えるテキストを入力
ko: 찾은 텍스트를 대치할 텍스트를 입력하십시오.
nl: Typ de tekst om de gevonden tekst te vervangen.
pl: Wprowadź tekst, który ma zastąpić tekst znaleziony.
pt: Digite o texto que substituirá o texto encontrado.
ru: Введите текст которым хотите заменить найденое.
tr: Bulunan metni değiştirecek metni girin.
zh_hans: 输入用来替换查找到的文本。
zh_hant: 輸入用來取代尋找到的文字。

source: Type the text to search for.
cs: Zadejte hledaný text.
de: Gib den Suchbegriff ein.
es: Escriba el texto para buscar.
fr: Tapez le texte à rechercher.
it: Inserire il testo da cercare.
ja: 検索するテキストを入力
ko: 검색할 텍스트를 입력하십시오.
nl: Typ de tekst waar je naar wilt zoeken.
pl: Wprowadź tekst do znalezienia.
pt: Digite o texto a buscar.
ru: Введите текст для поиска.
tr: Aranacak metni girin.
zh_hans: 输入要查找的文本。
zh_hant: 輸入要尋找的文字。
